ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0gx218_gx207/TIMA1_1.0.xml
        </group>
    <register id="TIMA1_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="EVT0_CFG" description="Event line mode select for event corresponding to CPU_INT" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to GEN_EVENT0" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT2_CFG" description="Event line mode select for event corresponding to GEN_EVENT1" begin="5" end="4" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="TIMA1_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <group id="TIMA1_COMMONREGS" name="TIMA1_COMMONREGS" instances="1" offset="0x1100" instaddr="0x2F" description="">
        <register id="TIMA1_CCPD" width="32" offset="0x0" description="CCP Direction">
            <bitfield id="C0CCP0" description="CCP0 direction" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="INPUT" value="0x0" description="Input"/>
                <bitenum id="OUTPUT" value="0x1" description="Output"/>
            </bitfield>
            <bitfield id="C0CCP1" description="CCP1 direction" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="INPUT" value="0x0" description="Input"/>
                <bitenum id="OUTPUT" value="0x1" description="Output"/>
            </bitfield>
        </register>
        <register id="TIMA1_ODIS" width="32" offset="0x4" description="Output Disable">
            <bitfield id="C0CCP0" description="Counter CCP0 Disable Mask
Defines whether CCP0 of Counter n is forced low or not" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CCP_OUTPUT_OCTL" value="0x0" description="Output function as selected by the OCTL register CCPO field are provided to output inversion block."/>
                <bitenum id="CCP_OUTPUT_LOW" value="0x1" description="CCP output occpout[0] is forced low."/>
            </bitfield>
            <bitfield id="C0CCP1" description="Counter CCP1 Disable Mask
Defines whether CCP0 of Counter n is forced low or not" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CCP_OUTPUT_OCTL" value="0x0" description="Output function as selected by the OCTL register CCPO field are provided to output inversion block."/>
                <bitenum id="CCP_OUTPUT_LOW" value="0x1" description="CCP output occpout[1] is forced low."/>
            </bitfield>
        </register>
        <register id="TIMA1_CCLKCTL" width="32" offset="0x8" description="Counter Clock Control Register">
            <bitfield id="CLKEN" description="Clock Enable
Disables the clock gating to the module. SW has to explicitly program the value
 to 0 to gate the clock." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Clock is disabled."/>
                <bitenum id="ENABLED" value="0x1" description="Clock is enabled"/>
            </bitfield>
        </register>
        <register id="TIMA1_CPS" width="32" offset="0xC" description="Clock Prescale Register">
            <bitfield id="PCNT" description="Pre-Scale Count
This field specifies the pre-scale count value.  The selected TIMCLK source is divided by a value of (PCNT+1). 
A PCNT value of 0 divides TIMCLK by 1, effectively bypassing the divider.
A PCNT value of greater than 0 divides the TIMCLK source generating a slower clock" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMA1_CPSV" width="32" offset="0x10" description="Clock prescale count status register">
            <bitfield id="CPSVAL" description="Current Prescale Count Value" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMA1_CTTRIGCTL" width="32" offset="0x14" description="Timer Cross Trigger Control Register">
            <bitfield id="CTEN" description="Timer Cross trigger enable. This field is used to enable whether the SW or HW logic can generate a timer cross trigger event in the system.
These cross triggers are connected to the respective timer trigger in of the other timer IPs in the SOC power domain.

The timer cross trigger is essentially the combined logic of the HW and SW conditions controlling EN bit in the CTRCTL register." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled."/>
                <bitenum id="ENABLE" value="0x1" description="Cross trigger generation enabled"/>
            </bitfield>
            <bitfield id="EVTCTEN" description="Enable the Input Trigger Conditions to the Timer module as a condition for Cross Triggers." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled."/>
                <bitenum id="ENABLE" value="0x1" description="Cross trigger generation enabled"/>
            </bitfield>
            <bitfield id="EVTCTTRIGSEL" description="Used to Select the subscriber port that should be used for input cross trigger." begin="19" end="16" width="4" rwaccess="R/W">
                <bitenum id="FSUB0" value="0x0" description="Use FSUB0 as cross trigger source."/>
                <bitenum id="FSUB1" value="0x1" description="Use FSUB1 as cross trigger source."/>
                <bitenum id="Z" value="0x2" description="Use Zero event  as cross trigger source."/>
                <bitenum id="L" value="0x3" description="Use Load event as cross trigger source."/>
                <bitenum id="CCD0" value="0x4" description="Use CCD0 event  as cross trigger source."/>
                <bitenum id="CCD1" value="0x5" description="Use CCD1 event  as cross trigger source."/>
                <bitenum id="CCD2" value="0x6" description="Use CCD2 event  as cross trigger source."/>
                <bitenum id="CCD3" value="0x7" description="Use CCD3 event  as cross trigger source."/>
                <bitenum id="CCU0" value="0x8" description="Use CCU0 event  as cross trigger source."/>
                <bitenum id="CCU1" value="0x9" description="Use CCU1 event  as cross trigger source."/>
                <bitenum id="CCU2" value="0xA" description="Use CCU2 event  as cross trigger source."/>
                <bitenum id="CCU3" value="0xB" description="Use CCU3 event  as cross trigger source."/>
            </bitfield>
        </register>
        <register id="TIMA1_CTTRIG" width="32" offset="0x1C" description="Timer Cross Trigger Register">
            <bitfield id="TRIG" description="Generate Cross Trigger
This bit when programmed will generate a synchronized trigger condition all the cross trigger enabled Timer instances including current timer instance." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled"/>
                <bitenum id="GENERATE" value="0x1" description="Generate Cross trigger pulse"/>
            </bitfield>
        </register>
        <register id="TIMA1_FSCTL" width="32" offset="0x20" description="Fault Source Control">
            <bitfield id="FCEN" description="This field controls whether the fault is caused by the system clock fault." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
            <bitfield id="FAC0EN" description="This field controls whether the fault signal is caused by COMP0 output." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
            <bitfield id="FAC1EN" description="This field controls whether the fault is caused by COMP1 output." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
            <bitfield id="FAC2EN" description="This field controls whether the fault is caused by COMP2 output." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
            <bitfield id="FEX0EN" description="This field controls whether the fault is caused by external fault pin 0." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
            <bitfield id="FEX1EN" description="This field controls whether the fault is caused by external fault pin 1." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
            <bitfield id="FEX2EN" description="This field controls whether the fault is caused by external fault pin 2." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
        </register>
        <register id="TIMA1_GCTL" width="32" offset="0x24" description="Global control register">
            <bitfield id="SHDWLDEN" description="Enables shadow to active load of bufferred registers and register fields." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
        </register>
